[
    {
        "short_title": "Unboared",
        "long_title": "Unboared - 2.0 Board Games",
        "img": "/images/projects/img-unboared.png",
        "imgVertical": "/images/projects/img-unboared-v.jpg",
        "brief": "Une nouvelle ère pour le jeu de société.",
        "description": "Unboared est une nouvelle façon de jouer à nos jeux de société favoris avec nos amis. Prenez simplement votre téléphone et votre ordinateur ou télévision et jouez à plus de 100 jeux.",
        "githubURL": "https://github.com/unboared",
        "url": "https://unboared.com",
        "labels": ["web"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "Unboared",
                "long_title": "Unboared - 2.0 Board Games",
                "brief": "A new era of board games.",
                "description": "Unboared is a new way to play your favorite board games with people you love. Just pick your phone(s), your computer or a TV and play together to +100 games. Come on, test it!"
            }
        }
    },
    {
        "short_title": "SDM'Studio",
        "long_title": "Sequential Decision Making Studio",
        "img": "/images/projects/img-sdms-h.png",
        "imgVertical": "/images/projects/img-sdms.png",
        "brief": "Bibliothèque logiciel pour la résolution des jeux stochastiques.",
        "description": "Bibliothèque logiciel contenant un ensemble d'outils et d'algorithmes pour la résolution des jeux stochastiques.",
        "githubURL": "https://github.com/SDMStudio/sdms",
        "url": "https://sdmstudio.github.io",
        "labels": ["ai"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "SDM'Studio",
                "long_title": "Sequential Decision Making Studio",
                "brief": "Solver and library for solving stochastic games.",
                "description": "SDMS (Sequential Decision Making Studio) is a software library containing a set of tools and algorithms for solving sequential decision making problems. The platform is based on algorithmic choices, resulting from a detailed analysis of the limitations of current methods."
            }
        }
    },
    {
        "short_title": "Weekook",
        "long_title": "Weekook : Générateur de recettes",
        "img": "/images/projects/weekook/logo.png",
        "imgVertical": "weekook/logo-v.png",
        "brief": "Générateur de listes de recettes pour la semaine.",
        "description": "Optimisez votre temps en générant chaque semaine, une nouvelle liste de recettes aléatoire pour la semaine. Catégorisez vos recettes pour créer des semaines à thèmes et partagez (bientôt) vos recettes avec vos proches.",
        "githubURL": "https://github.com/blavad/weekook",
        "url": "https://weekook.david-albert.fr",
        "labels": ["web"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "Weekook",
                "long_title": "Weekook: Recipe Generator",
                "brief": "Weekly recipe list generator.",
                "description": "Optimize your time by generating a new random list of recipes for the week. Categorize your recipes to create themed weeks and (soon) share your recipes with friends and family."
            }
        }
    },
    {
        "short_title": "MARL Library",
        "long_title": "MARL Library",
        "img": "/images/projects/img-marlapi-h.png",
        "imgVertical": "/images/projects/img-marlapi.png",
        "brief": "Librairie d'apprentissage par renforcement pour systèmes multi-agents.",
        "description": "Librairie d'apprentissage par renforcement pour systèmes multi-agents. La librairie est écrite en python et comprend différents algorithmes d 'apprentissage par renforcement. L’objectif de cette librairie python est de fournir la possibilité à l’utilisateur de déclarer et d’entraînersimplement un ensemble d’agents évoluant de manière simultanée dans un environnement.",
        "pdf": "/assets/pdf/projects/rapport-pfe.pdf",
        "githubURL": "https://github.com/blavad/marl",
        "url": "/marl",
        "labels": ["ai"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "MARL Library",
                "long_title": "MARL Library",
                "brief": "Reinforcement learning API for multi-agents systems.",
                "description": "Reinforcement learning API for multi-agents systems. The library is coded in python and contains both single and multi agents reinforcement learning algortihms. The purpose of the library is to provide users the possibility to initiate and train simultaneously the policy of several agents progessing in an environment."
            }
        }
    },
    {
        "short_title": "Draw a car : edges2car",
        "long_title": "Draw a car : edges2car",
        "img": "/images/projects/img-edges2car-h.png",
        "imgVertical": "/images/projects/img-edges2car.png",
        "brief": "Logiciel permettant de générer des images réalistes de voitures à partir d'un dessin et d'une couleur.",
        "description": "Logiciel permettant de générer des images réalistes de voitures à partir d'un dessin et d'une couleur. Pour se faire, nous utilisons une méthode récente pour le transfert de style nommée <a href='https://phillipi.github.io/pix2pix/'><em>pix2pix</em></a>. Cette méthode utilise un réseau de neurones génératif(GAN) qui a appris à modifier de façon adéquate le style d 'une image.",
        "pdf": "/assets/pdf/projects/stage-UnivDundee.pdf",
        "githubURL": "https://github.com/blavad/edge2car",
        "url": "https://georgezjchen.github.io/draw-a-car-build/",
        "labels": ["ai", "computing"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "Draw a car : edges2car",
                "long_title": "Draw a car : edges2car",
                "brief": "Realistic image of cars generator from a drawing and a color.",
                "description": "Software that allow the user to generate realistic images of cars from a simple edge drawing and a color. To achieve this result, we use a new method of style transfert called <a href='https://phillipi.github.io/pix2pix/'><em>pix2pix</em></a>. This method is based on new knowledge in deep learning, especially the active research field of generative model, to learn a function able to change the style of an image."
            }
        }
    },
    {
        "short_title": "weRbeer",
        "long_title": "weRbeer",
        "img": "/images/projects/img-sm-weRbeer.png",
        "imgVertical": "/images/projects/img-weRbeer-v.png",
        "brief": "Réseau social pour les amoureux de bières. Permet de partager des avis sur les bières.",
        "description": "Réseau social pour les amoureux de bières. L'idée de ce réseau social est de permettre à différentes personnes de partager leur avis sur les bières qu'ils ont goûté.",
        "pdf": "/assets/pdf/projects/proj-weRbeer.pdf",
        "githubURL": "https://github.com/blavad/weRbeer",
        "url": "https://werbeer.herokuapp.com",
        "labels": ["web"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "weRbeer",
                "long_title": "weRbeer",
                "brief": "Social network for beer lovers. Allow users to share their opinion about beers.",
                "description": "A social network for beer lovers. Users can save the beers they have tasted by giving them a rating and a review. By following other people, they will be able to know the opinion of their friends."
            }
        }
    },
    {
        "short_title": "DQN Flappy Bird",
        "long_title": "DQN Flappy Bird",
        "img": "/images/projects/dqn-flappy-h.gif",
        "imgVertical": "dqn-flappy-v.gif",
        "brief": "Apprentissage par renforcement pour le jeu Flappy Bird. Développement d'une version deux joueurs.",
        "description": "Développement d'une version deux joueurs de Flappy Bird (voir <a href='https://github.com/blavad/flappy-bird-env'>flappy-bird-2p</a>) et expérimentation de l'algorithme d'apprentissage par renforcement DQN pour faire jouer une IA avec un humain. Ce projet a été réalisé dans le cadre d'un stage chez <a href='https://www.pollen-robotics.com/'> Pollen Robotics </a>.",
        "pdf": "/assets/pdf/projects/stage-PollenRobotics.pdf",
        "githubURL": "https://github.com/blavad/DQN-tensorflow",
        "url": "https://github.com/blavad/DQN-tensorflow",
        "labels": ["ai"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "DQN Flappy Bird",
                "long_title": "Deep Q-learning for Flappy Bird",
                "brief": "Reinforcement learning for Flappy Bird. Development of a two-player version."
            }
        }
    },
    {
        "short_title": "INS'Arcade",
        "long_title": "Borne de jeu d'arcade",
        "img": "/images/projects/img-sm-insarcade.png",
        "imgVertical": "borne-200.jpg",
        "brief": "Borne de jeu d'arcade créée de toute pièce avec du matériel de récupération.",
        "description": "Borne de jeu d'arcade créée de toute pièce avec uniquement du matériel de récupération (coût total < 100€).La borne a été mise à disposition gratuitement des étudiants de l 'INSA de Rouen pendant un an. Cinq jeux y étaient disponibles. Ensuite, elle a été reconfigurée pour offrir une plus grande diversité de jeux grâce à l'OS <a href='https://www.recalbox.com/'>Recalbox</a>.",
        "pdf": "/assets/pdf/projects/proj-TIPNE.pdf",
        "githubURL": "https://github.com/blavad/Insarcade",
        "url": "/images/projects/insarcade",
        "labels": ["computing", "diy"],
        "public": false,
        "translations": {
            "en": {
                "short_title": "INS'Arcade",
                "long_title": "Arcade Game Machine",
                "brief": "Arcade game machine created from scratch with recycled materials.",
                "description": "Arcade game machine created from scratch with only recycled materials (total cost < 100€). The machine was made available for free to INSA Rouen students for a year. Five games were available. Then, it was reconfigured to offer a wider variety of games thanks to the OS <a href='https://www.recalbox.com/'>Recalbox</a>."
            }
        }
    }
]
